Revit 2026 API

# ViewDisplayBackground Methods

---

The ViewDisplayBackground type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | CreateGradient | Creates an object that can be passed to View.SetBackground method to set the background of the Gradient type. |
|  | CreateImage | Creates an object that can be passed to View.SetBackground method to set the background of the Image type. |
|  | CreateSky | Creates an object that can be passed to View.SetBackground method to set the background of the SunAndClouds type. |
|  | Dispose |  |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

#### Reference

ViewDisplayBackground Class

Autodesk.Revit.DB Namespace